app/controllers/soups_controller.rb

SELECT "soups".* FROM "soups"
---
	def index
		@soups = Soup.all

UPDATE "soups" SET "featured" = ?, "updated_at" = ? WHERE "soups"."id" = 4  [["featured", "t"], ["updated_at", "2014-07-15 17:22:45.456292"]]
---
	def toggle_featured
		@soup.toggle!(:featured)