app/views/categories/index.html.erb

	<% @categories.each do |category| %>
	<li><%= link_to category.name, category %> (<%=category.soups.count %>)</li>
---
SELECT COUNT(*) FROM "soups"  WHERE "soups"."category_id" = ?  [["category_id", 1]]