app/views/categories/show.html.erb

<ul>
	<% @category.soups.each do |soup| %>
---
SELECT "soups".* FROM "soups"  WHERE "soups"."category_id" = ?  [["category_id", 1]]